# Pyspark Handling Missing Values

   * Dropping Columns
   * Dropping Rows
   * Various Parameter In Dropping functionalities
   * Handling Missing values by Mean,Median And Mode

In [1]:
import pandas as pd
pd.read_csv('pysp3null - Sheet1.csv')

      Name   age  Experience  Salary
0    Mohit  31.0        10.0   30000
1    Krish  30.0         8.0   25000
2    Raman  29.0         4.0   20000
3  Santosh  24.0         3.0   15000
4    Bablu  23.0         1.0   20000
5     Paul  24.0         2.0   15000
6   Mahesh   NaN         NaN   18000
7      NaN  56.0        10.0   40000
8      NaN  43.0         NaN   38000

In [2]:
#Testing pyspark installation
import findspark
findspark.init()
findspark.find()
import pyspark
findspark.find()

'C:\\Program Files\\Spark\\spark-3.3.1-bin-hadoop2'

In [3]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [47]:
df_pyspark=spark.read.csv('pysp3null - Sheet1.csv').show()  # .show()

+-------+----+----------+------+
|    _c0| _c1|       _c2|   _c3|
+-------+----+----------+------+
|   Name| age|Experience|Salary|
|  Mohit|  31|        10| 30000|
|  Krish|  30|         8| 25000|
|  Raman|  29|         4| 20000|
|Santosh|  24|         3| 15000|
|  Bablu|  23|         1| 20000|
|   Paul|  24|         2| 15000|
| Mahesh|null|      null| 18000|
|   null|  56|        10| 40000|
|   null|  43|      null| 38000|
+-------+----+----------+------+

In [48]:
df_pyspark=spark.read.csv('pysp3null - Sheet1.csv',header=True,inferSchema=True)

In [49]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| age|Experience|Salary|
+-------+----+----------+------+
|  Mohit|  31|        10| 30000|
|  Krish|  30|         8| 25000|
|  Raman|  29|         4| 20000|
|Santosh|  24|         3| 15000|
|  Bablu|  23|         1| 20000|
|   Paul|  24|         2| 15000|
| Mahesh|null|      null| 18000|
|   null|  56|        10| 40000|
|   null|  43|      null| 38000|
+-------+----+----------+------+

In [50]:
## drop the columns
df_pyspark.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 15000|
|  23|         1| 20000|
|  24|         2| 15000|
|null|      null| 18000|
|  56|        10| 40000|
|  43|      null| 38000|
+----+----------+------+

In [51]:
df_pyspark.na.drop().show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Mohit| 31|        10| 30000|
|  Krish| 30|         8| 25000|
|  Raman| 29|         4| 20000|
|Santosh| 24|         3| 15000|
|  Bablu| 23|         1| 20000|
|   Paul| 24|         2| 15000|
+-------+---+----------+------+

In [52]:
#### any==how
df_pyspark.na.drop(how="all").show()

+-------+----+----------+------+
|   Name| age|Experience|Salary|
+-------+----+----------+------+
|  Mohit|  31|        10| 30000|
|  Krish|  30|         8| 25000|
|  Raman|  29|         4| 20000|
|Santosh|  24|         3| 15000|
|  Bablu|  23|         1| 20000|
|   Paul|  24|         2| 15000|
| Mahesh|null|      null| 18000|
|   null|  56|        10| 40000|
|   null|  43|      null| 38000|
+-------+----+----------+------+

In [53]:
df_pyspark.na.drop(how="any").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Mohit| 31|        10| 30000|
|  Krish| 30|         8| 25000|
|  Raman| 29|         4| 20000|
|Santosh| 24|         3| 15000|
|  Bablu| 23|         1| 20000|
|   Paul| 24|         2| 15000|
+-------+---+----------+------+

In [54]:
###thresold
df_pyspark.na.drop(how="any",thresh=3).show()  ##thresh=1,2,3...

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Mohit| 31|        10| 30000|
|  Krish| 30|         8| 25000|
|  Raman| 29|         4| 20000|
|Santosh| 24|         3| 15000|
|  Bablu| 23|         1| 20000|
|   Paul| 24|         2| 15000|
|   null| 56|        10| 40000|
+-------+---+----------+------+

In [55]:
##subset
df_pyspark.na.drop(how="any",subset=['age']).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Mohit| 31|        10| 30000|
|  Krish| 30|         8| 25000|
|  Raman| 29|         4| 20000|
|Santosh| 24|         3| 15000|
|  Bablu| 23|         1| 20000|
|   Paul| 24|         2| 15000|
|   null| 56|        10| 40000|
|   null| 43|      null| 38000|
+-------+---+----------+------+

In [56]:
### Filling the Missing value
df_pyspark.na.fill('Missing Values').show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Mohit|  31|        10| 30000|
|         Krish|  30|         8| 25000|
|         Raman|  29|         4| 20000|
|       Santosh|  24|         3| 15000|
|         Bablu|  23|         1| 20000|
|          Paul|  24|         2| 15000|
|        Mahesh|null|      null| 18000|
|Missing Values|  56|        10| 40000|
|Missing Values|  43|      null| 38000|
+--------------+----+----------+------+

In [57]:
df_pyspark.na.fill('Missing Value',['age','Experience','Name']).show()  #features or col wise

+-------------+----+----------+------+
|         Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Mohit|  31|        10| 30000|
|        Krish|  30|         8| 25000|
|        Raman|  29|         4| 20000|
|      Santosh|  24|         3| 15000|
|        Bablu|  23|         1| 20000|
|         Paul|  24|         2| 15000|
|       Mahesh|null|      null| 18000|
|Missing Value|  56|        10| 40000|
|Missing Value|  43|      null| 38000|
+-------------+----+----------+------+

In [58]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| age|Experience|Salary|
+-------+----+----------+------+
|  Mohit|  31|        10| 30000|
|  Krish|  30|         8| 25000|
|  Raman|  29|         4| 20000|
|Santosh|  24|         3| 15000|
|  Bablu|  23|         1| 20000|
|   Paul|  24|         2| 15000|
| Mahesh|null|      null| 18000|
|   null|  56|        10| 40000|
|   null|  43|      null| 38000|
+-------+----+----------+------+

In [59]:
from pyspark.ml.feature import Imputer

In [60]:
imputer = Imputer(
	inputCols=['age', 'Experience', 'Salary'],
	outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
	).setStrategy("mean")   #median,mode u also use

In [61]:
# Add imputation cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|  Mohit|  31|        10| 30000|         31|                10|         30000|
|  Krish|  30|         8| 25000|         30|                 8|         25000|
|  Raman|  29|         4| 20000|         29|                 4|         20000|
|Santosh|  24|         3| 15000|         24|                 3|         15000|
|  Bablu|  23|         1| 20000|         23|                 1|         20000|
|   Paul|  24|         2| 15000|         24|                 2|         15000|
| Mahesh|null|      null| 18000|         32|                 5|         18000|
|   null|  56|        10| 40000|         56|                10|         40000|
|   null|  43|      null| 38000|         43|                 5|         38000|
+-------+----+----------+------+-----------+------------------+--------------+